In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.isnull(None)

True

In [6]:
series_a = pd.Series([1,np.nan,9,7,None,4,np.nan])
pd.isnull(series_a)

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [7]:
pd.isnull(series_a).value_counts()

False    4
True     3
dtype: int64

In [8]:
pd.isnull(series_a).sum()

3

In [9]:
pd.notnull(series_a).sum()

4

In [10]:
series_a[pd.notnull(series_a)]

0    1.0
2    9.0
3    7.0
5    4.0
dtype: float64

In [11]:
series_a[pd.isnull(series_a)]

1   NaN
4   NaN
6   NaN
dtype: float64

In [12]:
series_a.dropna()

0    1.0
2    9.0
3    7.0
5    4.0
dtype: float64

In [13]:
series_a

0    1.0
1    NaN
2    9.0
3    7.0
4    NaN
5    4.0
6    NaN
dtype: float64

In [14]:
series_a.fillna('0')

0    1
1    0
2    9
3    7
4    0
5    4
6    0
dtype: object

In [16]:
series_b = series_a.fillna('0')

In [17]:
series_b

0    1
1    0
2    9
3    7
4    0
5    4
6    0
dtype: object

In [19]:
series_a.fillna(method = 'ffill')

0    1.0
1    1.0
2    9.0
3    7.0
4    7.0
5    4.0
6    4.0
dtype: float64

In [20]:
series_a

0    1.0
1    NaN
2    9.0
3    7.0
4    NaN
5    4.0
6    NaN
dtype: float64

In [21]:
series_a.fillna(method = 'bfill')

0    1.0
1    9.0
2    9.0
3    7.0
4    4.0
5    4.0
6    NaN
dtype: float64

In [31]:
data =  {
    'name':['vivek','ramesh','akram'],
    'marks':[77,87,98],
    'country':['nepal','india','pakistan'],
    'behaviour':['good','bad','ugly']}

In [32]:
df = pd.DataFrame(data)

In [33]:
df

     name  marks   country behaviour
0   vivek     77     nepal      good
1  ramesh     87     india       bad
2   akram     98  pakistan      ugly

In [34]:
name = pd.Series(['vivek','ramesh','akram'])

In [35]:
name

0     vivek
1    ramesh
2     akram
dtype: object

In [36]:
marks = pd.Series({'vivek':77,'ramesh':87,'akram':98})

In [37]:
marks

vivek     77
ramesh    87
akram     98
dtype: int64

In [38]:
country = pd.Series({'vivek':'Nepal','ramesh':'India','akram':'Pakistan'})

In [39]:
country

vivek        Nepal
ramesh       India
akram     Pakistan
dtype: object

In [46]:
database = pd.DataFrame([country,marks])

In [48]:
langs = pd.Series(['english','french','spanish'])

In [50]:
database['language'] = langs

In [51]:
database

   vivek ramesh     akram language
0  Nepal  India  Pakistan  english
1     77     87        98   french

In [54]:
data = {'name': ['Xavier', 'Ann', 'Jana', 'Yi', 'Robin', 'None', 'Nori'],
        'city': ['Mexico City', None, 'Prague', 'Shanghai','Manchester', 'Cairo', 'Osaka'],
        'age': [41, 28, None, 34, 38, 31, 37],
        'marks': [88.0, 79.0, 81.0, 80.0, 68.0, 61.0, None]
       }
df = pd.DataFrame(data,index = ['Xavier', 'Ann', 'Jana', 'Yi', 'Robin', 'Amal', 'Nori'])

In [55]:
df

          name         city   age  marks
Xavier  Xavier  Mexico City  41.0   88.0
Ann        Ann         None  28.0   79.0
Jana      Jana       Prague   NaN   81.0
Yi          Yi     Shanghai  34.0   80.0
Robin    Robin   Manchester  38.0   68.0
Amal      None        Cairo  31.0   61.0
Nori      Nori        Osaka  37.0    NaN

In [56]:
df.fillna(0)

          name         city   age  marks
Xavier  Xavier  Mexico City  41.0   88.0
Ann        Ann            0  28.0   79.0
Jana      Jana       Prague   0.0   81.0
Yi          Yi     Shanghai  34.0   80.0
Robin    Robin   Manchester  38.0   68.0
Amal      None        Cairo  31.0   61.0
Nori      Nori        Osaka  37.0    0.0

In [58]:
df.fillna({'name':'invalid','city':'not known','age':df['age'].mean(),'marks':50})

          name         city        age  marks
Xavier  Xavier  Mexico City  41.000000   88.0
Ann        Ann    not known  28.000000   79.0
Jana      Jana       Prague  34.833333   81.0
Yi          Yi     Shanghai  34.000000   80.0
Robin    Robin   Manchester  38.000000   68.0
Amal      None        Cairo  31.000000   61.0
Nori      Nori        Osaka  37.000000   50.0

In [59]:
df = pd.DataFrame({'age':[12,13,24,560,29],'sex':['M','F','F','D','?']})

In [60]:
df

   age sex
0   12   M
1   13   F
2   24   F
3  560   D
4   29   ?

In [62]:
df.replace({'D':'M',560:26})

   age sex
0   12   M
1   13   F
2   24   F
3   26   M
4   29   ?

In [64]:
df[df['age']>100]

   age sex
3  560   D

In [65]:
df[df['age']>100] = 20

In [66]:
df

   age sex
0   12   M
1   13   F
2   24   F
3   20  20
4   29   ?

In [67]:
ambassadors = pd.Series([
    'France',
    'United Kingdom',
    'United Kingdom',
    'Italy',
    'Germany',
    'Germany',
    'Germany',
], index=[
    'Gérard Araud',
    'Kim Darroch',
    'Peter Westmacott',
    'Armando Varricchio',
    'Peter Wittig',
    'Peter Ammon',
    'Klaus Scharioth '
])

In [68]:
ambassadors

Gérard Araud                  France
Kim Darroch           United Kingdom
Peter Westmacott      United Kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
Peter Ammon                  Germany
Klaus Scharioth              Germany
dtype: object

In [69]:
ambassadors.duplicated()

Gérard Araud          False
Kim Darroch           False
Peter Westmacott       True
Armando Varricchio    False
Peter Wittig          False
Peter Ammon            True
Klaus Scharioth        True
dtype: bool

In [70]:
ambassadors.drop_duplicates(keep = 'last')

Gérard Araud                  France
Peter Westmacott      United Kingdom
Armando Varricchio             Italy
Klaus Scharioth              Germany
dtype: object

In [71]:
ambassadors.drop_duplicates(keep = False)

Gérard Araud          France
Armando Varricchio     Italy
dtype: object

In [72]:
ambassadors

Gérard Araud                  France
Kim Darroch           United Kingdom
Peter Westmacott      United Kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
Peter Ammon                  Germany
Klaus Scharioth              Germany
dtype: object

In [73]:
players = pd.DataFrame({
    'Name': [
        'Kobe Bryant',
        'LeBron James',
        'Kobe Bryant',
        'Carmelo Anthony',
        'Kobe Bryant',
    ],
    'Pos': [
        'SG',
        'SF',
        'SG',
        'SF',
        'SF'
    ]
})

In [74]:
players

              Name Pos
0      Kobe Bryant  SG
1     LeBron James  SF
2      Kobe Bryant  SG
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

In [75]:
players.duplicated()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [76]:
players.duplicated(subset = ['Name'])

0    False
1    False
2     True
3    False
4     True
dtype: bool

# String Handling

In [93]:
df = pd.DataFrame({
    'Data': [
        '1987_M_US _1',
        '1990?_M_UK_1',
        '1992_F_US_2',
        '1970?_M_   IT_1',
        '1985_F_I  T_2'
]})

In [94]:
df

              Data
0     1987_M_US _1
1     1990?_M_UK_1
2      1992_F_US_2
3  1970?_M_   IT_1
4    1985_F_I  T_2

### Splitting columns

In [95]:
df['Data'].str.split('_')

0       [1987, M, US , 1]
1       [1990?, M, UK, 1]
2        [1992, F, US, 2]
3    [1970?, M,    IT, 1]
4      [1985, F, I  T, 2]
Name: Data, dtype: object

In [96]:
df

              Data
0     1987_M_US _1
1     1990?_M_UK_1
2      1992_F_US_2
3  1970?_M_   IT_1
4    1985_F_I  T_2

In [98]:
df = df['Data'].str.split('_', expand = True)

In [99]:
df.columns = ['Year', 'Sex', 'Country', 'No Children']

In [100]:
df

    Year Sex Country No Children
0   1987   M     US            1
1  1990?   M      UK           1
2   1992   F      US           2
3  1970?   M      IT           1
4   1985   F    I  T           2